#преобрезовать строку "50" в число, и сложить 50 и вывести результат 100
a = int("50") + 50
print(a)
#Преобразовать число 50 в строку, соединить со строкой "50" и вывести результат "5050" (как строку).
b = "50" + str(50)
print(b)

#создать число 1000, из трех строк
one = "1"
zero = "0", "0", "0"
summa = "1" + zero[0] +zero[1] + zero[2]
result = int(summa)
print(result)

#факториал числа 5 и 10
factorial_5 = 1 * 2 * 3 * 4 * 5
factorial_10 = 1 * 2 * 3 * 4 * 5 * 6 * 7 * 8 * 9 * 10
print(f"5! = {factorial_5}")
print(f"10! = {factorial_10}")